namespace OriginalStudio.Model.Channel
{
    using System;

    public enum EnumChannelType
    {
        None = 0,
        财付通 = 100,
        电信充值卡 = 0x71,
        短信 = 300,
        光宇一卡通 = 0x73,
        金山一卡通 = 0x74,
        久游一卡通 = 0x6d,
        骏网一卡通 = 0x6a,
        联华卡 = 0xcd,
        联通充值卡 = 0x6c,
        魔兽卡 = 0xcc,
        殴飞一卡通 = 0xd0,
        神州行充值卡 = 0x67,
        神州行福建卡 = 0xcb,
        神州行江苏卡 = 0xc9,
        神州行辽宁卡 = 0xca,
        神州行浙江卡 = 200,
        声讯卡 = 0x72,
        盛大一卡通 = 0x68,
        搜狐一卡通 = 0x70,
        腾讯Q币卡 = 0x6b,
        天宏一卡通 = 0x77,
        天下一卡通 = 0x76,
        天下一卡通专项 = 0xd1,
        完美一卡通 = 0x6f,
        网上银行 = 0x66,
        网易一卡通 = 110,
        征途支付卡 = 0x69,
        支付宝 = 0x65,
        纵游一卡通 = 0x75
    }
}

