namespace KuaiCard.Model.User
{
    using System;

    public enum UserLevelEnum
    {
        普通商家 = 1,
        会员商家 = 2,
        白银商家 = 4,
        黄金商家 = 8,
        白金商家 = 16,
        钻石商家 = 64,
        
        初级代理 = 101,
        中级代理 = 102, 

        高级代理 = 103,        
        超级代理 = 104,
        特级代理 = 105,
        普通代理 = 100,
        富豪商家 = 128




        //白金商家 = 0x10,
        //白银商家 = 4,
        //超级代理 = 0x68,
        //初级代理 = 0x65,
        //富豪商家 = 0x80,
        //高级代理 = 0x67,
        //黄金商家 = 8,
        //会员商家 = 2,
        //普通代理 = 100,
        //普通商家 = 1,
        //特级代理 = 0x69,
        //中级代理 = 0x66,
        //钻石商家 = 0x40
    }
}

